/*
================================================================================
🎉 행사 & 공모전 데이터
================================================================================
*/

const eventsData = [
  // @@@@@@@@@@@@@@@@@
  {
    category: "행사",
    image: "image/행사&공모전/오픈예배 포스터.jpg",
    subImage1: null,
    subImage2: null,
    title: "서울신학대학교 x 제이어스 오픈워십 ",
    date: "2026 - 04 - 25(토)",
    organizer: "총학생회",
    location: "서울신학대학교 성결인의 집",
    description: `[서울신학대학교 OPEN WORSHIP]

<Seed of Glory>
영광의 씨앗 - 요한복음 12:24

☑️ 장소: 서울신학대학교 성결인의 집
☑️ 일시: 2026년 4월 25일(토) 15시 
☑️ 대상: 다음 세대의 부흥을 희망하는 모든 예배자
☑️ 인원: 선착순 2,500명 (무료)
❗️개인 및 단체(3인 이상) 신청 가능❗️

📌재학생 사전 신청 : 3월 10일(화) 11:00 ~ 3월 15일 23:59
(선착순 신청으로 조기 마감될 수 있음을 알려드립니다.)

🎤 찬양: 제이어스 J-US
📖 말씀: 강은도 목사

다음 세대의 부흥을 갈망하는 
청소년, 청년, 교역자분들을 초청합니다!
복음을 위해 영광의 씨앗을 함께 심고,
하나님의 임재 속에서 새로운 부흥을 기대하는
특별한 은혜의 시간이 되길 소망합니다!`,
    link: null,
    applyLink: "https://forms.gle/8cQX6HpBWMiTwLNH8",
    details: {
      contact: "서울신학대학교 총학생회 카카오톡 플러스 채널 ",
      target: "서울신학대학교 모든 재학생 "
    },
  },
  // #####################

  // @@@@@@@@@@@@@@@@@
  {
    category: "행사",
    image: "image/행사&공모전/힐송 컨퍼런스.jpg",
    subImage1: null,
    subImage2: null,
    title: "힐송 컨퍼런스",
    date: "2026.03.26(목)",
    organizer: "서울신학대학교",
    location: "성결인의 집 ",
    description: `서울신학대학교와 HILLSONG COLLEGE가
2024년부터 협약을 맺어 "LEAD WORSHIPER" 교육 과정을
운영하고 있습니다.

오는 3월 26일, 한국의 모든 예배자들과 함께
힐송의 탁월한 예배 사역을 나누고 배우는 자리에 초청합니다.

"2026 STU-HILLSONG COLLEGE 예배찬양컨퍼런스"를 통해
하나님이 원하시고 기뻐하시는 예배를 함께 세워가기를 바랍니다.
(누구나 신청할 수 있는 오픈된 컨퍼런스입니다.)

교회와 공동체 그리고 주변에 널리 소식을 알려주시면
감사드리겠습니다.`,
    link: "https://2026stuhillsong.my.canva.site/c267ygc42f0ppzwh",
    applyLink: "https://docs.google.com/forms/d/e/1FAIpQLScTKEuuL52ILXHMgxyN8nYRsLUIT3upjuroGzgMjCGbE1x3Hw/viewform",
    details: {
      target: " 한국의 모든 예배자",
      contact: "서울신학대학교 교학과 (032-340-9265)",
      benefits: "재학생 저녁7시 집회 참여시 채플 마스터카드(채플1회 결석권) 배부"
    },
  },
  // #####################

  // @@@@@@@@@@@@@@@@@
  {
    category: "안내사항",
    image: "image/행사&공모전/KakaoTalk_20260311_105709679.jpg",
    subImage1: "image/행사&공모전/KakaoTalk_20260311_105709679_01.jpg",
    subImage2: null,
    title: "2026-1학기 신앙상담 신청안내",
    date: null,
    organizer: "교목처",
    location: null,
    description: `[📢 2026-1학기 신앙상담 신청 안내]

신앙상담은 비신자 학생들의 교회봉사 / 신앙생활 평가서를 대체하기 위한 제도입니다.
학기 중 1~2회 상담으로 대체할 수 있으니, 필요한 학생들은 아래 내용을 확인해 주세요.

- 신청 기간: 3월 10일(화) ~ 4월 24일(금)
- 상담 기간: 3월 17일(화) ~ 5월 22일(금)
- 신청 가능 시간: 09:00 ~ 17:30
  ※ 이후 문의는 다음 날 답변드립니다.
- 신청 방법: 본인 학년 / 학과 담당 목사님(교목, 멘토)께 개별 연락
- 유의 사항: 상담 미진행 시 해당 학기 채플 미이수 처리

자세한 담당자 배정 및 연락처는 첨부 이미지를 확인해 주세요.
감사합니다.

서울신학대학교 교목처`,
    link: null,
    applyLink: null,
    details: {},
  },
  // #####################

  // @@@@@@@@@@@@@@@@@
  {
    category: "프로젝트",
    image: "image/행사&공모전/교양교육원 학생 모니터링단.jpg",
    subImage1: null,
    subImage2: null,
    title: "교양교육원 학생 모니터링단 ",
    date: null,
    organizer: null,
    location: null,
    description: `[교양교육원 2026-1학기 학생모니터링단 모집 안내]


안녕하세요, 교양교육원 STU교양교육연구센터입니다.
2026-1학기 교양교육 학생모니터링단을 모집합니다:)

📌참여대상​   본교 학부 재학생

📌선발인원​   총 6명

📌신청기간   3/12(목)~3/22(일)까지
*내부 사정에 의해 변경될 수 있음

📌신청방법​   신청서 및 개인정보 수집 이용 동의서 작성-> e-Room 제출

📌활동기간   26년 3월~7월
*선발 확정 후  O.T  필수 참석

📌활동내용
-교양교육 설문 제작 및 결과보고서 작성

📌모니터링단 혜택
 - 위촉장 수여
 - 장학금 (활동시간에 따라 차등지급)

많은 관심과 참여 부탁드립니다 :)
감사합니다 :)`,
    link: null,
    applyLink: "https://eroom.stu.ac.kr?djkSNAr",
    details: {
      contact: "교양교육원 STU교양교육연구센터 032-340-9239"
    },
  },
  // #####################

  // @@@@@@@@@@@@@@@@@
  {
    category: "프로젝트",
    image: "image/행사&공모전/한국장학재단 멘토링 사업.png",
    subImage1: null,
    subImage2: null,
    title: "한국장학재단 멘토링사업",
    date: null,
    organizer: "주최: 다누리컴버시티센터",
    location: null,
    description: `🏡한국장학재단 멘토링 사업 사전 홍보 안내🏡

안녕하세요 다누리컴버시티센터입니다.
“교육의 가치” 를 나누며 장학금도 받고,
의미 있는 사회활동을 하고 싶지 않으신가요?

다누리컴버시티센터에서는 한국장학재단 대학생청소년교육지원사업과 다문화•탈북학생 멘토링 사업를 운영하고 있습니다. 
📚학업 향상을 위해 도와주고
🙋🏻‍♀️학교 생활 적응을 위해 이야기도 나눠주고
🍀함께 성장할 수 있는 기회!

멘티들을 향한 사랑만 있다면 누구나 참여할 수 있는 사업! 
교육적인 가치를 나누며 장학금도 받을 수 있는 기회 절대 놓치지 마세요! 자세한 내용은 카드뉴스를 참고하시고,
많은 관심 부탁드립니다 :) 
⭐️신청기간은 다음주~3월초 모집 예정이며 추가 공지 예정)
📞 문의 : 다누리컴버시티센터(032-340-9347)`,
    link: null,
    applyLink: null,
    details: {},
  },
  // #####################

  // @@@@@@@@@@@@@@@@@
  {
    category: "행사",
    image: "image/행사&공모전/아나바나 플리마켓.png",
    subImage1: null,
    subImage2: null,
    title: "아나바다 플리마켓",
    date: "2026.03.05(목)~2026.03.20(금)",
    organizer: "GREENUS(그린어스)",
    location: null,
    description: `♻️아나바다 플리마켓♻️

GREENUS 동아리와 호태원에서 2026 아나바다 플리마켓을 진행합니다! 

아나바다 플리마켓은 학우들이 더 이상 사용하지 않는 옷과 물품을 기부하면, 이를 필요로 하는 다른 학우들에게 다시 전달해 물건이 재사용될 수 있도록 하는 나눔 행사입니다.

모집 기간: 2026.03.05(목)~2026.03.20(금) 
모집 대상: 서울신학대학교 재학생

버리기엔 아깝고, 누군가에겐 소중한 물건.
내가 쓰지 않는 물건을 기부하며 자원순환을 실천하고, 작은 나눔으로 따뜻한 마음을 전해보세요!!

안 입는 옷, 사용하지 않는 물건 기부 가능 O

(* 기부해주신 물품은 아나바다 플리마켓에서 다른 물품으로 교환하실 수 있습니다)

학우 여러분의 많은 참여 바랍니다!`,
    link: null,
    applyLink: null,
    details: {
      contact: "문의 : 인스타그램 stu_greenus",
      target: "서울신학대학교 재학생"
    },
  },
  // #####################

  // @@@@@@@@@@@@@@@@@
  {
    category: "프로젝트",
    image: "image/행사&공모전/인권 서포터즈.png",
    subImage1: null,
    subImage2: null,
    title: "대학인권 서포터즈",
    date: "2026년 3월 9일 - 2026년 3월 16일",
    organizer: "대학인권센터",
    location: null,
    description: `[2026-1학기 대학인권센터 서포터즈 장학생 모집]
안녕하세요. 대학인권센터입니다.
2026학년도 1학기 동안 함께 활동할 인권서포터즈 장학생을 모집합니다.

★활동내용
- O.T 3월 중 예상
- 인권 캠페인 및 인권 교육 참여, 행사 지원 등
-활동 기록 및 피드백 공유

★활동혜택
- 활동 장학금 
※ 장학금 지급을 위한 서류 제출 필수

★신청기간
2026년 3월 9일 - 2026년 3월 16일

★신청방법
1. QR접속 or 이룸 링크 접속
https://eroom.stu.ac.kr?R8XSOXRt9
2. 신청서 작성 후 첨부하여 제출
3. 면접 대상자 개별 안내`,
    link: null,
    applyLink: "https://eroom.stu.ac.kr/Community/Program/ProgramView.aspx?pgdx=0A264A004CD3FEFFF4B00B42DFF7CC919A30B61ECEFEEDDBD841D6A12249825A&subNum=1",
    details: {
      contact: "대학인권센터 032-340-9453",
      benefits: "- 활동 장학금  ※ 장학금 지급을 위한 서류 제출 필수"
    },
  },
  // #####################

  // @@@@@@@@@@@@@@@@@
  {
    category: "프로젝트",
    image: "image/행사&공모전/학습 WE함 공동체.jpg",
    subImage1: null,
    subImage2: null,
    title: "학습 WE함 공동체",
    date: "모집기간: 02/26(목) ~ 3/20(금)",
    organizer: "교수학습개발센터",
    location: null,
    description: `[2026-1학기 교수학습개발센터 공동체 학습We함(+또래) 모집 안내]
안녕하세요. 교수학습개발센터입니다. 2026학년도 1학기 공동체 학습We함 참여자를 모집하고 있습니다.
공동체 학습We함은 학습에 “공동목표”가 있는 학생들이 3-5명 팀을 이루어 학습하는 프로그램으로 전공, 자격증 등 다양한 분야에서 참여할 수 있습니다. 자세한 내용은 이룸에서 확인 가능하며, 재학생 분들의 많은 관심과 참여 부탁드립니다^^
 
▶ 모집기간: 02/26(목) ~ 3/20(금)
▶ 참여혜택: 활동 종료 이후 심사를 통한 장학금 지급
(최우수 50만원 1팀, 우수 30만원 N팀, 장려 15만원 N팀, 성실 10만원 N팀) 
- 참여 완료자 전체 STU 마일리지 30,000점 지급
▶ O T 안내: 3월 26일(금), 오후 12시 예정, Zoom
▶ 신청링크: https://eroom.stu.ac.kr?8qbSwLJiQ

많은 관심과 참여 부탁드립니다.
감사합니다 :)`,
    link: null,
    applyLink: "https://eroom.stu.ac.kr/Community/Program/ProgramView.aspx?pgdx=7E3152486315A03A930D05811CECDD62A8AE5A1327B0FDE14C243A8AB363C570&subNum=1",
    details: {
      benefits: "활동 종료 이후 심사를 통한 장학금 지급 (최우수 50만원 1팀, 우수 30만원 N팀, 장려 15만원 N팀, 성실 10만원 N팀)  - 참여 완료자 전체 STU 마일리지 30,000점 지급",
      contact: "교수학습개발센터 032-340-9150"
    },
  },
  // #####################

];

const eventsConfig = {
  pageTitle: "교내 행사 & 공모전",
  pageSubtitle: "다양한 교내 활동에 참여해보세요!",
  suggestFormLink: "https://forms.gle/edD7CaFW92pCbjQm8",
  itemsPerPage: 15,
  categories: ["행사","공모전","프로젝트","안내사항"],
};
