/*
================================================================================
🎉 행사 & 공모전 데이터
================================================================================
*/

const eventsData = [
  // @@@@@@@@@@@@@@@@@
  {
    category: "프로젝트",
    image: "image/행사&공모전/학생 모니터링단 모집.png",
    subImage1: null,
    subImage2: null,
    title: "교수학습개발센터 모니터링단",
    date: null,
    organizer: "주최: 교수학습개발센터",
    location: null,
    description: `[2026-1학기 교수학습개발센터 H+ 학습지원 프로그램 환류 학생 모니터링단 모집안내]

안녕하세요. 교수학습개발센터입니다. 2026학년도 1학기 학생 모니터링단 지원자를 모집하고 있습니다.
모니터링단은 3명을 선발하며, 교수학습개발센터에서 진행 되는 프로그램에 직접 참여하여 프로그램 모니터링을 하는 프로그램입니다. 재학생 분들의 많은 관심과 참여 부탁드립니다^^
 
▶ 모집기간: 8/25 (월) ~ 9/12(금)
▶ 참여혜택: 활동장학금 30만원 (학기말 지급)
▶ O T 안내: 3월 17일(화) 대면, 오후 12시(예정),  
                 교수학습개발센터 내 스터디룸 (점심식사 제공)
                 많은 관심과 참여 부탁드립니다.
감사합니다 :)

문의) 교수학습개발센터 032-340-9150`,
    link: null,
    applyLink: "https://eroom.stu.ac.kr?YXWs2v0SE",
    details: {},
  },
  // #####################

  // @@@@@@@@@@@@@@@@@
  {
    category: "프로젝트",
    image: "image/행사&공모전/한국장학재단 멘토링 사업.png",
    subImage1: null,
    subImage2: null,
    title: "한국장학재단 멘토링사업",
    date: null,
    organizer: "주최: 다누리컴버시티센터",
    location: null,
    description: `🏡한국장학재단 멘토링 사업 사전 홍보 안내🏡

안녕하세요 다누리컴버시티센터입니다.
“교육의 가치” 를 나누며 장학금도 받고,
의미 있는 사회활동을 하고 싶지 않으신가요?

다누리컴버시티센터에서는 한국장학재단 대학생청소년교육지원사업과 다문화•탈북학생 멘토링 사업를 운영하고 있습니다. 
📚학업 향상을 위해 도와주고
🙋🏻‍♀️학교 생활 적응을 위해 이야기도 나눠주고
🍀함께 성장할 수 있는 기회!

멘티들을 향한 사랑만 있다면 누구나 참여할 수 있는 사업! 
교육적인 가치를 나누며 장학금도 받을 수 있는 기회 절대 놓치지 마세요! 자세한 내용은 카드뉴스를 참고하시고,
많은 관심 부탁드립니다 :) 
⭐️신청기간은 다음주~3월초 모집 예정이며 추가 공지 예정)
📞 문의 : 다누리컴버시티센터(032-340-9347)`,
    link: null,
    applyLink: null,
    details: {},
  },
  // #####################

  // @@@@@@@@@@@@@@@@@
  {
    category: "프로젝트",
    image: "image/행사&공모전/피어나크루.png",
    subImage1: null,
    subImage2: null,
    title: "피어나 크루(또래 상담사 모집)",
    date: null,
    organizer: "주최: 학생상담센터",
    location: null,
    description: `[26-1 피어나크루 또래상담사 모집]

안녕하세요 학생상담센터입니다. 26년 새학기 또래상담사(크루원)을 모집하오니 많은 관심 부탁드립니다.

- 대상: 2-3학년 학부생
- 신청기간 : 2월13일~2월26일(밤11시)
- 모집인원 : 5명
- 활동기간 : 1학기
- 장학금 지급`,
    link: null,
    applyLink: "https://eroom.stu.ac.kr?VE2uYkyIO",
    details: {},
  },
  // #####################

];

const eventsConfig = {
  pageTitle: "교내 행사 & 공모전",
  pageSubtitle: "다양한 교내 활동에 참여해보세요!",
  suggestFormLink: "https://forms.gle/edD7CaFW92pCbjQm8",
  itemsPerPage: 15,
  categories: ["행사","공모전","프로젝트"],
};
