/*
================================================================================
📱 SNS 피드 데이터
================================================================================
*/

const snsEmbeds = [
  // @@@@@@@@@@@@@@@@@
  {
    url: "https://www.instagram.com/stu__seed/",
  },
  // #####################

  // @@@@@@@@@@@@@@@@@
  {
    url: "https://www.instagram.com/stu_please_haksik/",
  },
  // #####################

  // @@@@@@@@@@@@@@@@@
  {
    url: "https://www.instagram.com/stu_please_partnership/",
  },
  // #####################

];

const snsHighlights = [
];
